run/Tests/convAnalysis1D/fine/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       preCellScalarField;
    location    "0";
    object      Phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0 0);

boundaryField
{
    top
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    bottom
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    left
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    right
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
    frontAndBack
    {
       type            homogenous;
       value           uniform (0 0 0 0 0 0 0 0 0 0);
    }
}


// ************************************************************************* //
