run/Tests/convAnalysis1D/fine/system/fvMesh/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default          Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,C)      Gauss Gamma 0.75;
    div(rho*phi,U)  Gauss GammaVDC 0.5;
    //limitedLinearV 1;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default           linear;
}

snGradSchemes
{
    default           uncorrected;
}

fluxRequired
{
    default         no;
    pd;
    pcorr;
    C;
    Psi;
}


// ************************************************************************* //
